Page({
  data:{
    content: '这是个测试数据，欧式一大堆，不写一大堆看不出效果，不知道写什么，乱七八糟的我看着难受，想好好写也不知道写什么，有浪费h时间。恩祥系诶段歌词，可是一时半会儿又没记起来，写着写着结果自己唱上了，可还行。然后就想好吧，来个意识流，瞎写吧，这不，一会就写这么多了，一点也不卡哈哈哈哈。我这絮絮叨叨的，还怕没得写？只是写这么一大段，我也很绝望啊。这是个测试数据，欧式一大堆，不写一大堆看不出效果，不知道写什么，乱七八糟的我看着难受，想好好写也不知道写什么，有浪费h时间。恩祥系诶段歌词，可是一时半会儿又没记起来，写着写着结果自己唱上了，可还行。然后就想好吧，来个意识流，瞎写吧，这不，一会就写这么多了，一点也不卡哈哈哈哈。我这絮絮叨叨的，还怕没得写？只是写这么一大段，我也很绝望啊这是个测试数据，欧式一大堆，不写一大堆看不出效果，不知道写什么，乱七八糟的我看着难受，想好好写也不知道写什么，有浪费h时间。恩祥系诶段歌词，可是一时半会儿又没记起来，写着写着结果自己唱上了，可还行。然后就想好吧，来个意识流，瞎写吧，这不，一会就写这么多了，一点也不卡哈哈哈哈。我这絮絮叨叨的，还怕没得写？只是写这么一大段，我也很绝望啊'
  },
  readCompleteDoc: function() {
    wx.navigateTo({
      url: './doc/doc?content=nishishuisuhauhd'
    })
  },
  onLoad:function(options){
    // 生命周期函数--监听页面加载
    
  },
  onReady:function(){
    // 生命周期函数--监听页面初次渲染完成
    
  },
  onShow:function(){
    // 生命周期函数--监听页面显示
    
  },
  onHide:function(){
    // 生命周期函数--监听页面隐藏
    
  },
  onUnload:function(){
    // 生命周期函数--监听页面卸载
    
  },
  onPullDownRefresh: function() {
    // 页面相关事件处理函数--监听用户下拉动作
    
  },
  onReachBottom: function() {
    // 页面上拉触底事件的处理函数
    
  },
  onShareAppMessage: function() {
    // 用户点击右上角分享
    return {
      title: 'title', // 分享标题
      desc: 'desc', // 分享描述
      path: 'path' // 分享路径
    }
  }
})